app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos"   ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT  "produtos".* FROM "produtos"   ORDER BY "produtos"."preco" ASC LIMIT 2
---
	def index
        @produtos_por_nome = Produto.order(:nome).limit 5
        @produtos_por_preco = Produto.order(:preco).limit 2

INSERT INTO "produtos" ("created_at", "descricao", "nome", "preco", "quantidade", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-12-09 05:10:38.009830"], ["descricao", "testando né"], ["nome", "Casaco teste2"], ["preco", 15.0], ["quantidade", 123], ["updated_at", "2015-12-09 05:10:38.009830"]]
---
    def create
    valores = params.require(:produto).permit :nome, :preco, :descricao, :quantidade
    produto = Produto.create