app/controllers/produtos_controller.rb

	def index
        @produtos_por_nome = Produto.order :nome
---
SELECT "produtos".* FROM "produtos"