app/controllers/sessions_controller.rb

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."usuario" = 'lucas039123' LIMIT 1
---
  def create
      user = Usuario.find_by(usuario: params[:session][:usuario].downcase)