app/controllers/usuarios_controller.rb

  def edit
      @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @usuario = Usuario.new(usuario_params)
      if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "senha", "updated_at", "usuario") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-26 16:34:30.544295"], ["senha", "220295"], ["updated_at", "2015-11-26 16:34:30.544295"], ["usuario", "Lucas"]]

  def update
    @usuario = Usuario.find(params[:id])
    if @usuario.update_attributes(usuario_params)
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "usuarios" SET "password_digest" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["password_digest", "$2a$10$UMTxWauWEKZEchTP2FjtC.su5WUa.GXTMZ2qtm.6ePYUDINuVcVHO"], ["updated_at", "2015-12-08 04:32:10.185580"]]